# Задача 1
# age = int(input("Возраст: ")) 
# res =  "Доступ разрешен" if age >= 18 and age <= 50 else "Вы уже старый" if age > 50 else "Иди домой"
# print(res)

# Задача 2
# my_passwords = ["qwerty", "12345678"] 
# user_input = input("Введите пароль: ") 
# res = "Пароль верный" if user_input in my_passwords else "Неверный пароль"
# print(res)

# Задача 3
# number = int(input("Пожалуйста введите цифру: ")) 
# types = "четным" if number % 2 == 0 else "нечетным"
# print(f'Ваша цифра {number} является {types} .')

# Задача 4
# boolean = False
# res = f"{boolean} является истинoй" if boolean else f"{boolean} не истина"
# print(res)

# Задача 5
# name = input("Ваше имя: ") 
# names = ["Mark", "Kate", "Anna", "Smit"] 
# res = f"{name} в нашем классе" if name in names else f"{name} не в нашем классе"
# print(res)

print(100 / 0)