# # Задача 1
# for i in range(5):
#     print("0", i+1)

# # Задача 2
# lst = [] 
# for i in range(1, 101):
#     lst.append(i)
# print(lst)    
 
# Задача 3
# for i in range(1, 498):
#     if i % 2 == 0:
#         print(i, "четный")
#     else:
#         print(i, "нечетный")

# Задача 4
# lst = [] 
# for i in range(1, 1001):
#     lst.append(i)
# print(lst) 
# print(min(lst))
# print(max(lst))
# print(sum(lst))
    
# Задача 5 
# lst = []  
# for i in range(100):
#     lst.append(0)
# print(lst)

# Задача 6
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))
# num1, num2 = num2, num1
# print(num1)
# print(num2)

# Задача 7
# while True:
#     age = int(input("Введите свой возраст: "))
#     if age >= 18 and age < 70:
#         print("Доступ разрешен")
#         break
#     else:
#         print("Извините, пользование данным ресурсом только с 18 лет")
#         continue